---                                                                                                                                                                                              
  layout: post
  title: AI Programming
---

## 智能化：人机协同的编程方式

## 历史

### 智能化发端

### 智能化现状

## 智能化定义
打通功能、智能和智力、智慧的边界，以人机协同的方式进行软件开发
人机协同的编程方式

## 智能化概念

### 功能(Capability)

### 智能(Intelligence)

### 智力(Intellect)

### 智慧(Wisdom)

## 智能化特性

### 确定性

### 鲁棒性

### 进化性

## 智能化原则

### 面向数据原则

### 实现之实现原则

### 人机竞合原则

### 反馈闭环原则

## 智能化模式

### 决策模式

### 创意模式

### 先验模式

### 后验模式

### 创建模式

### 结构模式

### 行为模式
